<?php require 'header.php';

?> 

<!DOCTYPE html>
<html >

	
<link rel='stylesheet' id='layers-framework-css'  href='http://www.math.sc.chula.ac.th/wp-content/themes/newmath/assets/css/framework.css?ver=1.1.1' type='text/css' media='all' />
<link rel='stylesheet' id='layers-components-css'  href='http://www.math.sc.chula.ac.th/wp-content/themes/newmath/assets/css/components.css?ver=1.1.1' type='text/css' media='all' />
<link rel='stylesheet' id='layers-style-css'  href='http://www.math.sc.chula.ac.th/wp-content/themes/newmath/style.css?ver=1.1.1' type='text/css' media='all' />
<script type='text/javascript' src='http://www.math.sc.chula.ac.th/wp-includes/js/jquery/jquery.js?ver=1.11.2'></script>



	
                
<section id="post-515" class="content-main clearfix post-515 page type-page status-publish hentry container">
	 

        <h1 class="heading"> สาขาวิชาวิทยาการคอมพิวเตอร์</h1>
                        
                <br>
        
   
    <div class="story   ">
    
    <div class="su-tabs su-tabs-style-default" data-active="1"><div class="su-tabs-nav"><span class="" data-url="" data-target="blank">หน้าหลัก</span><span class="" data-url="" data-target="blank">รายละเอียดหลักสูตร</span><span class="" data-url="" data-target="blank">หน้าหลัก</span></div><div class="su-tabs-panes"><div class="su-tabs-pane su-clearfix">
<h2 align="center">หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์</h2>
<p>ภาควิชาคณิตศาสตร์ ได้เปิดสอนหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ มาตั้งแต่ปี พ.ศ. 2535 จุดเด่นของหลักสูตรฯ คือการเน้นความรู้ในด้านทฤษฎีและเสริมความรู้ด้านการประยุกต์ เพื่อให้บัณฑิตมีความรู้พื้นฐานด้านวิทยาการคอมพิวเตอร์ที่เข้มแข็งพอที่จะศึกษาค้นคว้า พัฒนาความรู้ในระดับกว้างและลึกขึ้น อีกทั้งสามารถนำศาสตร์ทางคอมพิวเตอร์ไปแก้ปัญหาได้อย่างมีประสิทธิภาพ ปัจจุบันความรู้ในศาสตร์และเทคโนโลยีหลากหลายสาขามีการเปลี่ยนแปลงอย่างรวดเร็วขึ้น บัณฑิตจึงควรมีศักยภาพในการเชื่อมโยงความรู้ในหลาย ๆ สาขาเพื่อนำไปพัฒนาเทคโนโลยีทางคอมพิวเตอร์และประยุกต์ได้อย่างเหมาะสม นอกจากนี้ยังมีการนำคอมพิวเตอร์และซอฟต์แวร์ไปใช้อย่างกว้างขวาง ในองค์กรต่าง ๆ บัณฑิตจึงควรมีความรู้ ความเข้าใจในหลักการพัฒนาซอฟต์แวร์เพื่อให้สามารถพัฒนาซอฟต์แวร์อย่างมีประสิทธิภาพ ประกอบกับการใช้งาน ในวงกว้างผ่านระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ทำให้บัณฑิตจำเป็นต้องมีความรู้พื้นฐานด้านการสื่อสารข้อมูลผ่านระบบเครือข่าย และกฎหมาย ด้านเทคโนโลยีสารสนเทศ อันจะนำไปสู่การทำงานอย่างมีประสิทธิภาพ</p>
<h3>ปรัชญาของหลักสูตร</h3>
<p>หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์มุ่งเน้นให้บัณฑิตมีความรู้เชิงทฤษฎี ความสามารถเชิงปฏิบัติ และ จริยธรรมในวิชาชีพ</p>
<h3>วัตถุประสงค์ของหลักสูตร</h3>
<p>เพื่อผลิตบัณฑิตที่มีคุณสมบัติต่อไปนี้</p>
<ol>
<li>มีความรู้เชิงทฤษฎีทางวิทยาการคอมพิวเตอร์และความสามารถเชิงปฏิบัติ โดยมีความรู้ทางคณิตศาสตร์อย่างเพียงพอที่จะสามารถพัฒนางานทางด้านคอมพิวเตอร์ได้อย่างมีประสิทธิภาพ และ/หรือศึกษาต่อในระดับสูงขึ้นไป</li>
<li>เป็นผู้ใฝ่รู้และแสวงหาความรู้ด้วยตนเองอย่างต่อเนื่อง มีความคิดริเริ่มสร้างสรรค์ มีทักษะในการสื่อสาร และสามารถทำงานเป็นกลุ่ม</li>
<li>มีศักยภาพในการทำงานวิจัย</li>
<li>มีความรอบรู้ด้านวิทยาศาสตร์พื้นฐานและคณิตศาสตร์ สามารถวิเคราะห์และแก้ปัญหาด้วยวิธีการทางวิทยาศาสตร์ และมีศักยภาพในการค้นคว้า ติดตามความเจริญก้าวหน้าทางวิชาการระดับสากล</li>
<li>มีคุณธรรม จริยธรรมและความรับผิดชอบต่อสังคม</li>
</ol>
<h3>คุณลักษณะบัณฑิตที่พึงประสงค์</h3>
<ol>
<li>มีความรู้เชิงทฤษฎีทางวิทยาการคอมพิวเตอร์ และความสามารถเชิงปฏิบัติ โดยมีความรู้ทางคณิตศาสตร์อย่างเพียงพอที่จะสามารถพัฒนางานทางด้านคอมพิวเตอร์ได้อย่างมีประสิทธิภาพ และ/หรือศึกษาต่อในระดับสูงขึ้นไป</li>
<li>เป็นผู้ใฝ่รู้และแสวงหาความรู้ด้วยตนเองอย่างต่อเนื่อง มีความคิดริเริ่มสร้างสรรค์ มีทักษะในการสื่อสาร การจัดการ และสามารถทำงานเป็นกลุ่ม</li>
<li>มีความรอบรู้ด้านวิทยาศาสตร์พื้นฐานและคณิตศาสตร์ สามารถวิเคราะห์และแก้ปัญหาด้วยวิธีการทางวิทยาศาสตร์ และมีศักยภาพในการค้นคว้า ติดตามความเจริญก้าวหน้าทางวิชาการระดับสากล</li>
<li>มีศักยภาพในการทำงานสายวิชาชีพและงานวิจัย</li>
<li>มีจรรยาบรรณในการประกอบวิชาชีพ รวมถึงการปฏิบัติตนตามกฎหมายเทคโนโลยีสารสนเทศ</li>
<li>มีคุณธรรม จริยธรรมและความรับผิดชอบต่อสังคม</li>
</ol>
</div>
<div class="su-tabs-pane su-clearfix"> <div class="su-accordion">
<h2 align="center">หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์</h2>
<p>ภาควิชาคณิตศาสตร์ ได้เปิดสอนหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ มาตั้งแต่ปี พ.ศ. 2535 จุดเด่นของหลักสูตรฯ คือการเน้นความรู้ในด้านทฤษฎีและเสริมความรู้ด้านการประยุกต์ เพื่อให้บัณฑิตมีความรู้พื้นฐานด้านวิทยาการคอมพิวเตอร์ที่เข้มแข็งพอที่จะศึกษาค้นคว้า พัฒนาความรู้ในระดับกว้างและลึกขึ้น อีกทั้งสามารถนำศาสตร์ทางคอมพิวเตอร์ไปแก้ปัญหาได้อย่างมีประสิทธิภาพ ปัจจุบันความรู้ในศาสตร์และเทคโนโลยีหลากหลายสาขามีการเปลี่ยนแปลงอย่างรวดเร็วขึ้น บัณฑิตจึงควรมีศักยภาพในการเชื่อมโยงความรู้ในหลาย ๆ สาขาเพื่อนำไปพัฒนาเทคโนโลยีทางคอมพิวเตอร์และประยุกต์ได้อย่างเหมาะสม นอกจากนี้ยังมีการนำคอมพิวเตอร์และซอฟต์แวร์ไปใช้อย่างกว้างขวาง ในองค์กรต่าง ๆ บัณฑิตจึงควรมีความรู้ ความเข้าใจในหลักการพัฒนาซอฟต์แวร์เพื่อให้สามารถพัฒนาซอฟต์แวร์อย่างมีประสิทธิภาพ ประกอบกับการใช้งาน ในวงกว้างผ่านระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ทำให้บัณฑิตจำเป็นต้องมีความรู้พื้นฐานด้านการสื่อสารข้อมูลผ่านระบบเครือข่าย และกฎหมาย ด้านเทคโนโลยีสารสนเทศ อันจะนำไปสู่การทำงานอย่างมีประสิทธิภาพ</p>
<h3>ปรัชญาของหลักสูตร</h3>
<p>หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์มุ่งเน้นให้บัณฑิตมีความรู้เชิงทฤษฎี ความสามารถเชิงปฏิบัติ และ จริยธรรมในวิชาชีพ</p>
<h3>วัตถุประสงค์ของหลักสูตร</h3>
<p>เพื่อผลิตบัณฑิตที่มีคุณสมบัติต่อไปนี้</p>
<ol>
<li>มีความรู้เชิงทฤษฎีทางวิทยาการคอมพิวเตอร์และความสามารถเชิงปฏิบัติ โดยมีความรู้ทางคณิตศาสตร์อย่างเพียงพอที่จะสามารถพัฒนางานทางด้านคอมพิวเตอร์ได้อย่างมีประสิทธิภาพ และ/หรือศึกษาต่อในระดับสูงขึ้นไป</li>
<li>เป็นผู้ใฝ่รู้และแสวงหาความรู้ด้วยตนเองอย่างต่อเนื่อง มีความคิดริเริ่มสร้างสรรค์ มีทักษะในการสื่อสาร และสามารถทำงานเป็นกลุ่ม</li>
<li>มีศักยภาพในการทำงานวิจัย</li>
<li>มีความรอบรู้ด้านวิทยาศาสตร์พื้นฐานและคณิตศาสตร์ สามารถวิเคราะห์และแก้ปัญหาด้วยวิธีการทางวิทยาศาสตร์ และมีศักยภาพในการค้นคว้า ติดตามความเจริญก้าวหน้าทางวิชาการระดับสากล</li>
<li>มีคุณธรรม จริยธรรมและความรับผิดชอบต่อสังคม</li>
</ol>
<h3>คุณลักษณะบัณฑิตที่พึงประสงค์</h3>
<ol>
<li>มีความรู้เชิงทฤษฎีทางวิทยาการคอมพิวเตอร์ และความสามารถเชิงปฏิบัติ โดยมีความรู้ทางคณิตศาสตร์อย่างเพียงพอที่จะสามารถพัฒนางานทางด้านคอมพิวเตอร์ได้อย่างมีประสิทธิภาพ และ/หรือศึกษาต่อในระดับสูงขึ้นไป</li>
<li>เป็นผู้ใฝ่รู้และแสวงหาความรู้ด้วยตนเองอย่างต่อเนื่อง มีความคิดริเริ่มสร้างสรรค์ มีทักษะในการสื่อสาร การจัดการ และสามารถทำงานเป็นกลุ่ม</li>
<li>มีความรอบรู้ด้านวิทยาศาสตร์พื้นฐานและคณิตศาสตร์ สามารถวิเคราะห์และแก้ปัญหาด้วยวิธีการทางวิทยาศาสตร์ และมีศักยภาพในการค้นคว้า ติดตามความเจริญก้าวหน้าทางวิชาการระดับสากล</li>
<li>มีศักยภาพในการทำงานสายวิชาชีพและงานวิจัย</li>
<li>มีจรรยาบรรณในการประกอบวิชาชีพ รวมถึงการปฏิบัติตนตามกฎหมายเทคโนโลยีสารสนเทศ</li>
<li>มีคุณธรรม จริยธรรมและความรับผิดชอบต่อสังคม</li>
</ol>
</div>

<div class="su-tabs-pane su-clearfix"> <div class="su-accordion">
<h2 align="center">หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์</h2>
<p>ภาควิชาคณิตศาสตร์ ได้เปิดสอนหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ มาตั้งแต่ปี พ.ศ. 2535 จุดเด่นของหลักสูตรฯ คือการเน้นความรู้ในด้านทฤษฎีและเสริมความรู้ด้านการประยุกต์ เพื่อให้บัณฑิตมีความรู้พื้นฐานด้านวิทยาการคอมพิวเตอร์ที่เข้มแข็งพอที่จะศึกษาค้นคว้า พัฒนาความรู้ในระดับกว้างและลึกขึ้น อีกทั้งสามารถนำศาสตร์ทางคอมพิวเตอร์ไปแก้ปัญหาได้อย่างมีประสิทธิภาพ ปัจจุบันความรู้ในศาสตร์และเทคโนโลยีหลากหลายสาขามีการเปลี่ยนแปลงอย่างรวดเร็วขึ้น บัณฑิตจึงควรมีศักยภาพในการเชื่อมโยงความรู้ในหลาย ๆ สาขาเพื่อนำไปพัฒนาเทคโนโลยีทางคอมพิวเตอร์และประยุกต์ได้อย่างเหมาะสม นอกจากนี้ยังมีการนำคอมพิวเตอร์และซอฟต์แวร์ไปใช้อย่างกว้างขวาง ในองค์กรต่าง ๆ บัณฑิตจึงควรมีความรู้ ความเข้าใจในหลักการพัฒนาซอฟต์แวร์เพื่อให้สามารถพัฒนาซอฟต์แวร์อย่างมีประสิทธิภาพ ประกอบกับการใช้งาน ในวงกว้างผ่านระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต ทำให้บัณฑิตจำเป็นต้องมีความรู้พื้นฐานด้านการสื่อสารข้อมูลผ่านระบบเครือข่าย และกฎหมาย ด้านเทคโนโลยีสารสนเทศ อันจะนำไปสู่การทำงานอย่างมีประสิทธิภาพ</p>
<h3>ปรัชญาของหลักสูตร</h3>
<p>หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์มุ่งเน้นให้บัณฑิตมีความรู้เชิงทฤษฎี ความสามารถเชิงปฏิบัติ และ จริยธรรมในวิชาชีพ</p>
<h3>วัตถุประสงค์ของหลักสูตร</h3>
<p>เพื่อผลิตบัณฑิตที่มีคุณสมบัติต่อไปนี้</p>
<ol>
<li>มีความรู้เชิงทฤษฎีทางวิทยาการคอมพิวเตอร์และความสามารถเชิงปฏิบัติ โดยมีความรู้ทางคณิตศาสตร์อย่างเพียงพอที่จะสามารถพัฒนางานทางด้านคอมพิวเตอร์ได้อย่างมีประสิทธิภาพ และ/หรือศึกษาต่อในระดับสูงขึ้นไป</li>
<li>เป็นผู้ใฝ่รู้และแสวงหาความรู้ด้วยตนเองอย่างต่อเนื่อง มีความคิดริเริ่มสร้างสรรค์ มีทักษะในการสื่อสาร และสามารถทำงานเป็นกลุ่ม</li>
<li>มีศักยภาพในการทำงานวิจัย</li>
<li>มีความรอบรู้ด้านวิทยาศาสตร์พื้นฐานและคณิตศาสตร์ สามารถวิเคราะห์และแก้ปัญหาด้วยวิธีการทางวิทยาศาสตร์ และมีศักยภาพในการค้นคว้า ติดตามความเจริญก้าวหน้าทางวิชาการระดับสากล</li>
<li>มีคุณธรรม จริยธรรมและความรับผิดชอบต่อสังคม</li>
</ol>
<h3>คุณลักษณะบัณฑิตที่พึงประสงค์</h3>
<ol>
<li>มีความรู้เชิงทฤษฎีทางวิทยาการคอมพิวเตอร์ และความสามารถเชิงปฏิบัติ โดยมีความรู้ทางคณิตศาสตร์อย่างเพียงพอที่จะสามารถพัฒนางานทางด้านคอมพิวเตอร์ได้อย่างมีประสิทธิภาพ และ/หรือศึกษาต่อในระดับสูงขึ้นไป</li>
<li>เป็นผู้ใฝ่รู้และแสวงหาความรู้ด้วยตนเองอย่างต่อเนื่อง มีความคิดริเริ่มสร้างสรรค์ มีทักษะในการสื่อสาร การจัดการ และสามารถทำงานเป็นกลุ่ม</li>
<li>มีความรอบรู้ด้านวิทยาศาสตร์พื้นฐานและคณิตศาสตร์ สามารถวิเคราะห์และแก้ปัญหาด้วยวิธีการทางวิทยาศาสตร์ และมีศักยภาพในการค้นคว้า ติดตามความเจริญก้าวหน้าทางวิชาการระดับสากล</li>
<li>มีศักยภาพในการทำงานสายวิชาชีพและงานวิจัย</li>
<li>มีจรรยาบรรณในการประกอบวิชาชีพ รวมถึงการปฏิบัติตนตามกฎหมายเทคโนโลยีสารสนเทศ</li>
<li>มีคุณธรรม จริยธรรมและความรับผิดชอบต่อสังคม</li>
</ol>

</div></div></div></div></div></div></div>
    
        </div>


<link rel='stylesheet' id='font-awesome-css'  href='//netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css?ver=4.1.0' type='text/css' media='all' />
<link rel='stylesheet' id='su-box-shortcodes-css'  href='http://www.math.sc.chula.ac.th/wp-content/plugins/shortcodes-ultimate/assets/css/box-shortcodes.css?ver=4.9.7' type='text/css' media='all' />
<script type='text/javascript' src='http://www.math.sc.chula.ac.th/wp-content/plugins/youtube-channel/assets/lib/magnific-popup/jquery.magnific-popup.min.js?ver=3.0.7.3'></script>
<script type='text/javascript' src='http://www.math.sc.chula.ac.th/wp-content/plugins/shortcodes-ultimate/assets/js/other-shortcodes.js?ver=4.9.7'></script>

</html>